Repository: Danhia/42CTF
Catalog: src/resources/locale/*/LC_MESSAGES/django.po
Languages: de, es

source: What is 42CTF ?
de: Was ist 42CTF?
es: ¿ Qué es 42CTF ?

source: A short introduction to CTF
de: Eine kurze Einführung zu CTF
es: Una corta introducción a CTF

source: CTF stands for Capture The Flag. It is a cybersecurity competition, where participants have to solve challenges of various categories to gain points and progress on the scoreboard.
de: CTF steht für Capture The Flag. Es ist ein Computersicherheitswettbewerb, indem Teilnehmer Herausforderungen verschiedener Kategorien lösen müssen um die meisten Punkte zu verdienen.
es: CTF significa Capture the Flag. Es una competición de ciberseguridad, en la que los participantes tienen que resolver retos de diferentes categorías para ganar puntos y progresar en la Tabla de puntos.

source: The challenges require participants to find sort of passwords called \
de: Die Herausforderungen bestehen darin eine Art Passwort zu finden: sogenannte \
es: Los retos requieren que los participantes encuentren unas contraseñas llamadas \

source: Functionment of 42CTF
de: Funktionsweise von 42CTF
es: Funcionamiento de 42CTF

source: 42CTF is what we call a permanent CTF.
de: 42CTF ist ein sogenanntes Dauer-CTF.
es: 42CTF es lo que llamamos un CTF permanente.

source: Except from the
de: Außer bei
es: A excepción de

source: events
de: Ereignissen
es: eventos

source: challenges are available on the platform without time limitations.
de: sind Herausforderungen auf der Plattform unbegrenzt zugänglich.
es: los retos están disponibles en la plataforma sin limites de tiempo.

source: The registration on 42CTF is open to everyone, 42 students or not.
de: Die Registrierung bei 42CTF ist für jeden offen, ob 42-Student oder nicht.
es: El registro a 42CTF está abierto a todo el mundo, estudiantes de 42 o no.

source: Events may or may not be open. If you would like to organize an event on 42CTF, feel free to contact us.
de: Ereignisse können öffentlich oder privat sein. Wenn Sie ein Ereignisse bei 42CTF organisieren möchten, kontaktieren Sie uns.
es: Los eventos pueden o no estar abiertos. Si quieres organizar un evento en 42CTF, sientete libre de contactarnos.

source: 42CTF Team
de: das 42CTF Team
es: Equipo de 42CTF

source: 42CTF is managed by 42 students.
de: 42CTF wird von 42-Studenten verwaltet.
es: 42CTF está gestionado por estudiantes de 42.

source: You can meet the team on
de: Treffen können Sie das Team auf
es: Puedes conocer al equipo en

source: Challenges are created by various contributors, not necessarily 42 students.
de: Herausforderungen werden von verschiedenen Mitwirkende beigetragen, nicht zwingend 42-Studenten.
es: Los retos son creados por varios contribuidores, no necesariamente estudiantes de 42.

source: Anyone is welcome to submit their own challenges, either on the permanent CTF or for a specific event.
de: Beiträge sind von jedem willkommen, entweder auf dem Dauer-CTF, oder für ein bestimmtes Ereignis.
es: Todo el mundo está bienvenido a publicar sus propios retos, en el CTF permanente o en un evento en específico.

source: Create new challenges
de: Erstelle neue Herausforderungen
es: Crear retos nuevos

source: If you want to create new challenges for 42CTF, send us a message on
de: Falls Sie Herausforderungen für 42CTF erstellen möchten, schicken Sie uns eine Nachricht auf
es: Si quieres crear nuevos retos para 42CTF, mandanos un mensaje en

source: If your challenge is offline, then you don't have to ask us in advance.
de: Falls Ihre Herausforderung offline ist, müssen Sie uns nicht im voraus fragen.
es: Si tu reto es offline, no nos tienes que avisar por adelantado.

source: If your challenge is online (for example web or pwn), then you should give us a short description of what you want to do.
de: Falls Ihre Herausforderung online ist (z.B. web oder pwn), dann sollten sie uns eine kurze Beschreibung von dessen was sie vorhaben geben.
es: Si tu evento es online (por ejemplo web o pwn), entonces deberias mandarnos una corta descripción de lo que quieres hacer.

source: We may be able to help you or to give you resources such as dockerfiles.
de: Wir können Ihnen helfen oder Ressourcen sowie Dockerfiles zur Verfügung stellen.
es: Podemos ser de ayuda o darte recursos como dockerfiles.

source: We plan to make those resources publicly available in a near future.
de: Wir haben vor diese Ressourcen in naher Zukunft zu veröffentlichen.
es: Planeamos publicar estos recursos al publico en un futuro cercano.

source: Donate
de: Spenden
es: Donar

source: Become a 42CTF member
de: 42CTF-Mitglied werden
es: Convertirse en un miembro de 42CTF

source: 42CTF is a non-profit organization with a legal status under the french law (Association loi 1901).
de: 42CTF ist eine gemeinnützige Organisation mit einem Rechtsstatus nach französischem Recht (Association loi 1901).
es: 42CTF es una organización sin ánimo de lucro bajo un estatus legal bajo la ley francesa (loi de asociación 1901).

source: You can support us by becoming a member and paying a fee of 15 euros.
de: Sie können uns unterstützen indem Sie Mitglied werden und 15 Euro zahlen.
es: Puedes apoyarnos convirtiendote en un miebro y pagandonos una comisión de 15 euros.

source: Membership is then granted for 1 year.
de: Die Mitgliedschaft wird dann für ein Jahr gewährt.
es: La membresia dura 1 año.

source: When you become a member, you gain the following advantages:
de: Wenn sie Mitglied werden, bekommen sie folgende Vorteile:
es: Cuando te conviertes en un miembro, ganas las siguientes ventajas:

source: A different color for your pseudo in the scoreboard, to let everyone know you're a member.
de: Eine verschiedene Farbe für Ihren Nutzernamen im Punktestand, sodass jeder weiß dass Sie ein Mitglied sind.
es: Un color diferente para tu pseudo en la tabla de puntuaciones para que todo el mundo sepa que eres un miembro.

source: The possibility to play again past CTF, with challenges no longer available, in the form of private events with the people of your choice.
de: Die Möglichkeit einen vergangenen CTF zu wiederholen, mit Herausforderungen die nicht mehr verfügbar sind, in Form von privaten Ereignissen mit Menschen Ihrer Wahl.
es: La posibilidad e jugar un CTF del pasado, con retos que ya no están disponibles, crear eventos privados con gente de tu elección.

source: Ex: you played Welcome CTF 2021, and want to play it again with your friends during one weekend.
de: Z.B.: Sie haben am Welcome CTF 2021 teilgenommen, und wollen es mit Ihren Freunden an einem Wochenende wiederholen.
es: Ejemplo: Si jugaste CTF 2021, y quieres volverlo a jugar con tus amigos durante un fin de semana.

source: Or you didn't play Welcome CTF 2021 because you were not eligible.
de: Oder sie haben nicht am Welcome CTF 2021 teilgenommen weil sie nicht berechtigt waren.
es: O no jugaste el Welcome CTF 2021 porque no estabas disponible.

source: More advantages may come later, and you can submit us your ideas.
de: Weitere Vorteile können später folgen, und Sie können uns Ihre Ideen mitteilen.
es: Más ideas llegarán pronto, y puedes enviarnos ideas.

source: However, we will not organize limited time CTF for members only, as this will be equivalent to organize paid events, and we want 42CTF to remain FREE for all.
de: Trotzdem werden wir keine zeitlich begrenzte CTFs nur für Mitglieder organisieren, da diese Zahlungspflichtige Ereignissen gleichen, und wir 42CTF KOSTENLOS für alle zugänglich behalten wollen.
es: Sin embargo, no organizaremos CTF de tiempo limitado para miembros, ya que esto sería equivalente a organizar eventos de pago, y queremos mantener 42CTF GRATIS para todos.

source: Donate to 42CTF
de: An 42CTF spenden
es: Dona a 42CTF

source: You can donate to 42CTF or pay your membership with the following means:
de: Folgende Zahlungsmethoden sind für eine Spende an 42CTF den Kauf einer Mitgliedshaft verfügbar:
es: Puedes donar a 42CTF o pagar tu membresía con los siguientes métodos de pago:

source: If you would like us to add another payment method or if you want to pay in cash, send us a message !
de: Falls Sie möchten, dass wir eine andere Zahlungsmethode hinzufügen oder lieber Bar zahlen möchten, schicken sie uns eine Nachricht!
es: Si quieres que añadamos otro metodo de pago o quieres pagarnos en efectivo ¡Mandanos un mensaje!

source: If you're paying for your membership, don't forget to send us your first and last name, as well as your 42CTF pseudo.
de: Falls sie für eine Mitgliedschaft zahlen, vergessen sie nicht uns Ihren vor und Nachnamen, sowie Ihren 42CTF Nutzernamen mitzuteilen.
es: Si estás pagando por tu membresía, no olvides mandarnos tu nombre y apellido, también tu nombre de usuario en 42CTF

source: We will only use thoe data to keep track of our members and grant you advantages, and we will never communicate them to any third party.
de: Wir verwenden diese Daten nur um den Überblick über unsere Mitglieder zu Behalten und ihnen Vorteile zu bieten, und werden sie niemals an einem Dritten übermitteln.
es: Solo usarmos los datos para tener control de la lista de miembros y darte las ventajas de miembro, nunca se los daremos a ningún tercero.

source: Edit this page
de: Diese Seite bearbeiten
es: Editar esta página

source: More information coming soon, but as you can guess it involves making a pull request to your favorite
de: Weitere Information wird folgen, doch sowie Sie es erraten können benötigt es eine Pull Request auf ihrer lieblings
es: Más información llegará pronto, pero como puedes imaginar requiere hacer un pull request a tu favorito

source: Recommended Tools
de: Empfohlene Werkzeuge
es: Herramientas Recomendadas

source: To get you started, we built a VM that you can simply import in
de: Zum beginnen haben wir eine VM erstellt die Sie einfach importieren können
es: Para empezar, hemos creado una Máquina Virtual que simplemente puedes importar.

source: with a bunch of useful tools.
de: mit vielen nützlichen Werkzeugen.
es: con unas cuantas herramientas útiles.

source: You can dowload this OVA
de: Herunterladen können Sie die OVA
es: Puedes descargar este OVA

source: here
de: Hier
es: aquí

source: Here are the tools installed on the VM:
de: Folgende Werkzeuge sind auf der VM vorinstalliert:
es: Aquí están las herramientas instaladas en la Máquina Virtual:

source: If you want to solve the challenges on your own machine, we recommend you to use a Linux operating system.
de: Falls sie die Herausforderung auf Ihrer eigenen Maschine lösen möchten, empfehlen wir Ihnen einen Linux Betriebssystem zu verwenden.
es: Si quieres resolver los retos en tu propia máquina, te recomendamos usar Linux como sistema operativo.

source: Most of the reverse challenges are ELF binaries and won't run on Mac OS or Windows.
de: Die meisten Reverse-Engineering Herausforderungen sind ELF-Binärdateien und können auf macOS oder Windows nicht ausgeführt werden.
es: La mayoría de retos de ingeniería inversa usan binarios ELF y no funcionarán en Mac OS o Windows.

source: Additionnaly, you will need the following languages interpreters:
de: Zusätzlich, werden sie folgende Skript-Interpreter benötigen:
es: Además, necesitarás tender los siguientes interpretes de lenguaje:

source: Translate 42CTF
de: 42CTF Übersetzen
es: Traducir 42CTF

source: 42CTF source code is publicly available on this
de: 42CTF's Quellcode ist öffentlich zugänglich auf dieser
es: El código de 42CTF está disponible al público aquí

source: Translation does not require any programming skill and is a good way to contribute if you want to help us, by making the platform always more accessible.
de: Übersetzung benötigt keine Programmierkenntnisse und ist ein gute Möglichkeit beizutragen wenn sie uns helfen möchten, indem Sie diese Plattform immer zugänglicher machen.
es: La traducción no requiere saber programación y es una buena forma para contribuir si quieres ayudarnos, haciendo la plataforma siempre más accesible.

source: We have a
de: Wir haben einen
es: Tenemos un

source: describing how to translate pages with the Django internalization module.
de: indem beschrieben wird wie man mit dem Django Internationalisierungsmodul Seiten übersetzt.
es: Describiendo como traducir las páginas con el modulo de internacionalización Django.

source: We invite you to read it to know all the details, but it merely requires you to edit text files, so you see, no programming skills required ;)
de: Wir laden Sie dazu ein es zu lesen um alle Einzelheiten zur Kenntnis zu nehmen, doch schrecken Sie sich nicht ab, es ist nichts mehr als Textverarbeitung, keine Programmierkenntnisse sind benötigt ;)
es: Te invitamos a leerlo para conocer todos los detalles, pero simplemente rquiere que edites archivos de texto, asi que como ves, no hace falta saber programar ;)

source: You will need to fork the git repository, make your changes, push them, and then open a pull request so that we can merge your contributions into our repository.
de: Sie müssen das git Repository forken, Ihre Änderungen tätigen, pushen, und eine Pull Request eröffnen, sodass wir Ihre Beiträge in unsere Repository mergen können.
es: Vas a necesitar hacer un Fork del repositorio de git, hacer tus cambios, hacer un push y entonces abrir un Pull request para que podamos hacer merge de tus cambios a nuestro repositorio.

source: Don't hesitate to reach for help on
de: Zögern Sie nicht, nach Hilfe zu bitten auf
es: No dudes en pedirnos ayuda
